[{"_id":{"$oid":"60b0af866a343db79f5ecbba"},"header":"ASP.Net MVC and PHP MVC ?","id_User":{"$oid":"60fd35f768f6813ec9869f94"},"date_created":"2019-02-25","categories":"Technology","Tags":["ASP.Net","MVC","PHP"],"detail":"My Question is straightforward. I come across a random website that has been developed following the MVC pattern.\n\nBut how do I determine whether it is .Net MVC or PHP MVC? Is there a viable way to tell that from any indications?\n\nLooking ahead to some insightful answers.\n\nThanks.","like":10,"unlike":3,"check":true,"img":"","Answer":[{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"Use this browser plugin (chrome + firefox), it can do it all for you :)","date":"2019-09-15","like":23,"unlike":0,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":""},{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"You can check the X-Powered-By HTTP response header. If it's not repressed then you should see either asp.net or php as the value. There's also the server HTTP response header that is often set to Apache for php powered sites.","date":"2019-09-15","like":12,"Avatar":"images\/users\/user-3.jpg","Name":"Nguyễn Hà Minh Nghi","unlike":5,"check":true,"img":""}]},{"_id":{"$oid":"60b0b21d309f2a03b070129e"},"header":"Full Ajax PHP MVC Framework","id_User":{"$oid":"60fd35f768f6813ec9869f94"},"date_created":"2020-01-25","categories":"Technology","Tags":["PHP","AJAX","MVC","FRAMEWORK"],"detail":"I want to create a website. I want to use Ajax for every hyperlink and form. I wanted to use jquery but it is hard to create a general code for every link. I want to know if there is any PHP MVC Framewrok which works with ajax? thanx.\n\nphp\n","like":6,"unlike":0,"check":true,"img":"","Answer":[{"IDUser":{"$oid":"60fd37cf68f6813ec9869f99"},"Answer":"@Kenan, There wasn't in december but now there is Agile Toolkit. It's open source too.\n\nThe way how it works is you put a \"View\" on your \"Page\" and then can manipulate with it through javascript. So here is example:\n\n$view=$page->add('LoremIpsum');\n$button=$page->add('Button')->setLabel('Reload Ipsum');\n\n$button->js('click', $view->js()->reload());\nClicking button would use AJAX to reload the section of the page.\n\nPlease comment and let me know what if this is what you were looking for. As a contributor i'm interested.","date":"2019-09-15","like":6,"unlike":3,"Avatar":"images\/users\/user-7.jpg","Name":"Trần Tiến Minh","check":true,"img":""},{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"Currently they're no \"full\" ajax mvc's for PHP - BUT:\n\nCheck out atk-framework.com, xisc.com or cakephp.org.\n\nSince they're frameworks, the interfaces you will be using for the application can be implemented onto the platform; you'll be able to use the MVC-framework as platform for a self-written wrapper you put onto it..\n\n[ [FRAMEWORK] <------> [CONTROL] <------> [VIEW] ] <------> [APPLICATION]\nIf you implement it like that, the application uses a second layer which is managed by the mvc and requestable via an internal API.\n\nMight seem complicated, but well, the only and to me most logical solution :)","date":"2019-09-15","like":3,"unlike":9,"Avatar":"images\/users\/user-2.jpg","Name":"Nguyễn Hà Minh","check":true,"img":""}]},{"_id":{"$oid":"60f2485aada337428008505c"},"header":"If your website is meant to adjust with the size of the screen, should your units be in pixels or em or rem?","id_User":{"$oid":"60fd37cf68f6813ec9869f99"},"date_created":"2019-12-25","categories":"Technology","Tags":["HTML","CSS","FRONT-END"],"detail":"If you are building a website that is meant for the desktop browser and smartphone browser, should you size the html elements would px, rem, or em?","like":0,"unlike":2,"Answer":[],"check":true,"img":""},{"_id":{"$oid":"60f254b5ada33742800850af"},"header":"Out of all of Ted Mosby's major love interests (Robin, Tracy, Victoria, Stella, and Zoey), who do you think would have been the best fit for Ted and why?","id_User":{"$oid":"60dd85355cf2404ae46f63b3"},"date_created":"2020-10-25","categories":"Movies","Tags":["TV-SHOWS","NETFLIX"],"detail":"Zoey - they disagreed and couldn’t support each other, definitely out of contention.\n\nStella - clearly prefers her ex and wasn’t as in to Ted as much as hadn’t been swept off her feet in a long time. Loved her but clearly not a good fit with Ted.\n\nVictoria - This one could have worked out if Ted ever got Robin out of his system. If they had met under different circumstances, post dating Robin then I think they would have made it work. Definitely a contender.\n\nTracy - Fits with Ted in a lot of ways - shares his quirks and interests in music and literature, planning nerdy car trips and similar attitudes to life. Ted married her and was very, very happy.\n\nRobin - Ted and Robin work better as friends than as lovers. They clearly enjoy each other’s company and have a similar sense of humour. But aren’t as great a fit in terms of interests and life goals, Robin seeing a lot of Ted’s preferences as nerdy and boring where Ted sees a lot of Robin’s values as too right-wing (guns, cigar smoking, basically the side of her that Barney connects with)\n\nUnsurprisingly I have to hand this one to Tracy - they just fit together best.","like":0,"unlike":2,"Answer":[{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"I am always #teamrobin\n\nBut considering Ted’s vision of marriage and love, I would say Victoria was the best fit for him . The series didnt show much about the relationship between him and Tracy but season 1 & 7 explored the relationship between him and Victoria .\n\nVictoria was selfish but for the right reasons . She always wanted Ted to be her side at all times , at all costs even.\n\nShe may have cheated on him but Ted too cheated on her , so lets take it that this whole cheating thing to be blamed on their long distance relationship.\nHowever Victoria walked out of a wedding just for Ted and even moved in with him to see if they can pick up where they left. Sure enough, things were going smooth till she asked him to leave Robin and stop being friends with her .\n\nThis is where Ted is being tested whether he truly loves Victoria or not . If he was able to see that she walked out of a wedding just for him , the series would have ended on a different note . Overall the 2 ladies who created Ted to be Ted are Victoria and Tracy ,which somehow or rather brought him back to Robin .\nStella and Zoey are women that broke him and made him a better person and somewhat made him to take risks in relationships.","date":"2019-09-15","like":3,"unlike":2,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":""},{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"You know why Tracy is referred to as “The Mother”, right?\n\nBecause she is the best fit for Ted. His other half. His soulmate. The One.\n\nIf you are not convinced I advise you to (re)watch “How Your Mother Met Me” episode (S9, Ep16). The writers disappointed us with almost every episode of season 9 except for that one. Watch it and you will know why Tracy is the best fit for Ted.\n\nGranted that Victoria was once considered to become The Mother, I would put her in second place, behind Tracy.","date":"2019-09-15","like":12,"unlike":4,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":""},{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"It always Tracy. She is a Mother. <3","date":"2021-07-25","like":0,"unlike":0,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":"images\/uploads\/60fd6065e25b20.31188318.jpg"}],"check":true,"img":""},{"_id":{"$oid":"60f25664ada33742800850c6"},"header":"So finally who won the Game of Thrones?","id_User":{"$oid":"60dd85355cf2404ae46f63b3"},"date_created":"2020-10-25","categories":"Movies","Tags":["TV-SHOWS","HBO"],"detail":"It can be reasonably inferred from the series that Bran was the mastermind of Westerosi politics, his every statement calculated according to its impact and weighed for its importance.\n\nHe made people work according to him, like feeding people bits of information at correct times for clever propagation, case in point, Jon's lineage to Samwell Tarly.\n\nHe had either always wanted the throne, or thought that his coronation would be the best for all of Westeros. In the end, a Stark sits on the throne of the seven kingdoms, a Stark rules Winterfell, and a Stark sets sail for the west after successfully defeating the biggest threat of them all. Sansa and Arya have one of the best character developments in the series, and they both emerged to be winners in the Game of Thrones.\n\n>D<","like":3,"unlike":2,"Answer":[{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"The Starks…\n\nBran is the ruler of the Six Kingdoms.\n\nSansa rules the seventh.\n\nJon ‘rules’ the eighth — the land beyond the wall. His passive leadership style really suits the free-folks.\n\nArya will ‘rule’ the West of Westeros and whatever lands she discovers.\n\nNone of them ever wanted to play, let alone win, the game of thrones.\n\nThose who wanted to play and win, are all dead.","date":"2019-09-15","like":2,"unlike":1,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":""}],"check":true,"img":""},{"_id":{"$oid":"60f257a1ada33742800850d6"},"header":"Is it bad to read too many books?","id_User":{"$oid":"60dd856d5cf2404ae46f63b4"},"date_created":"2019-10-15","categories":"Books","Tags":["BOOKS"],"detail":"Long ago I used to love books. Books about life, books that looked from a million angles at life. Books that looked at a million lives. Books that helped me 'figure out' life. I knew a lot about life. I could talk a lot about life. I could even get many people who heard me and agreed that I had it all figured out.\n\nUntil I realized that I knew a lot about life, but had I been living it?\n\nIt was like taking a hundred pictures of a beautiful sunset using two dozen camera modes and settings, sharing it with friends, winning accolades, approvals and envy - and yet not taking a pause to experience the sunset itself.\n\nI realized the books were my selfies. A pile of evidence to prove that I had experienced something called life. But could the evidence be the experience?\n\nI was eager to study life, but afraid to live it. Books were my gateway to a dimension where I could build my own mental models of the world, find the concepts to justify it and live happily ever after. The more models I could build, the more concepts I could flaunt, the more authors I could cite - the more real the world seemed, the thicker the walls became. I had built my grand personal fortress.\n\nI was absolutely right in my kingdom. And I was absolutely alone.\n\nThere were people surrounding me. But the price of admission was believing in my ideas. Or believing in the idea of 'being open to all ideas'. Or believing in the idea of 'being open to life'.\n\nBecause I could ‘rationally’ and ‘logically’ prove why each and every one of my ideas was right - based on the innumerable books I had read and the knowledge I had accumulated. If someone had any opinions about the ‘limitations of logic’ or the ‘perils of being too rational’ I could disprove them too. And relax back into my intellectual cocoon.\n\nThey only had an idea. I had ideas, books, knowledge, critical thinking and logical arguments to back them up. Therefore I was right.\n\nI was not arrogant and surely not ‘rigid’! Would a rigid person put in so many reading hours to verify he was right? It was not about the need for my ideas to be right. I knew they were right. :) And hence people who put in similar hours and reached similar conclusions were also right.\n\nIt did not matter what those ideas were, as long as we all agreed to those ideas. It was like prisoners agreeing on the color of the prison walls. Same prisons, ‘better’ crimes.\n\nWe were all together. We were all right. We were respected.\n\nWe were still alone.\n\nAnd we wondered why we were disconnected.\n\nWhat we did not realize is it is not about how we arrive at our mental models of the world. But the fact that they are models of the world - not the world itself. The rigidity is not in the process - but in the result: A static version of a fluid reality.\n\nThe question is not “Is it wrong to read and think about life?” but “Do I feel disconnected anyway?”","like":23,"unlike":15,"Answer":[{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"YES\n\nIf you read too many books you will:\n\nLearn too much about the world and question reality.\nTalk too much at parties and never get laid.\nYour partner will leave the bed because pillow talk has become a forum for philosophical debate.\nDiscard your childlike perception of the world and realise everything is terrible.\nUse words in your tinder profile like ‘epistemological’ and nobody will date you.\nHave no space for your personal belongings as your habitation space will be filled with books.\nBecome poor and homeless because you have spent all your money on books.","date":"2019-09-15","like":3,"unlike":4,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":""}],"check":true,"img":""},{"_id":{"$oid":"60f25991ada33742800850dc"},"header":"How do you say “take out your earphones” in Spanish?","id_User":{"$oid":"60dd856d5cf2404ae46f63b4"},"date_created":"2020-03-25","categories":"Language","Tags":["SPANISH"],"detail":"You would say “quítate los auriculares\" or “scare los auriculares de las orejas\"","like":2,"unlike":5,"Answer":[],"check":true,"img":""},{"_id":{"$oid":"60f25a78ada33742800850dd"},"header":"Why do some fluent English speakers pluralize words that aren’t normally pluralized like “youse guys better be here,” “alls I have is” and “those are mines”?","id_User":{"$oid":"60fd37cf68f6813ec9869f99"},"date_created":"2018-10-25","categories":"Language","Tags":["ENGLISH"],"detail":"There are many style levels in a language. The examples you give are not standard, although some standard speakers may say “youse guys” in fun. I’m not sure if these are strictly American dialect. I don’t think I have ever heard them in Canada, and usually on TV and in movies or books, the second and third examples are slightly different:\n\n“Alls I got is” and “Them’s mine.”","like":2,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"Here in South Africa it's common for non native English speakers, such as my self, to say, yous peoples come here now. Although thats mostly the unintentional as they are trying to speak English while pluralising the words the same as in Afrikaans.\n\nYou singular is Jy pronounced Yay\n\nYou pular is Julle pronounced Yə-llə\n\nHuman is Mens pronounced almost the way it's written with a slightly longer e\n\nPeople is Mense pronounced Mens-ə\n\nSo it's common for people who only learned it at school to speak it this way as they don't always know the correct plurals.","date":"2019-09-15","like":5,"unlike":2,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":""}],"check":true,"img":""},{"_id":{"$oid":"60f25b8eada33742800850eb"},"header":"What animal is way bigger than what the average person thinks it is?","id_User":{"$oid":"60fd37cf68f6813ec9869f99"},"date_created":"2019-05-25","categories":"Science","Tags":["BIOLOGY"],"detail":"People usually have a fair idea of the size of most large land animals, because it’s much easier to judge size when there are objects in the background. Not all of them (moose and elephant seals come to mind), but the majority, I’d say.\n\nIn the ocean, however, there is no backdrop except endless blue. Unless there’s a diver in the frame for scale, we tend to assume that many marine animals are smaller than they actually are - similar in size to the average land-dwelling creature.\n\nNonetheless, the buoyancy of water allows animals in the sea to become very large without having to support much of their own weight. Here are some oceangoing species which are probably larger than you realized.","like":2,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"When you envision “centipede’’ or “millipede’’, you probably think of the tiny little thingies scurrying for cover every time you lift up a rock. They’re small, barely longer than an inch or so, and (despite looking pretty creepy) you know that they aren’t able to hurt you.\n\n","date":"2019-09-15","like":5,"unlike":1,"Avatar":"images\/users\/user-3.jpg","Name":"Nguyễn Hà Minh Nghi","check":true,"img":""}],"check":true,"img":""},{"_id":{"$oid":"60f94710cb7d000035005202"},"header":"How is the book version of Severus Snape different than the movie version?","id_User":{"$oid":"60fd35f768f6813ec9869f94"},"date_created":"2021-07-22","categories":"Books","Tags":["BOOKS"],"detail":"Book Snape is only 31 when we first meet him, skinny and nervy and probably not very confident, quite ugly and with straight hair which hangs in curtains (although it's possible it was short in the first book). He wears monk-like black robes with a cloak over the top, and apparently nothing underneath except boots and underpants. He tries to hide his feelings, but he isn't very good at it and we see him, for example, grasping a chair-back in shock when he hears that Ginny has been taken into the Chamber of Secrets, white and shaking when he sees Cedric's death in Harry's memory, and sheet-white with terror when he has to go back to Voldemort. If anything, he's very emotional - we see him shake and shout, blench and flush, and become verbally incoherent when stressed. Film Snape is about 20 years older, much more hefty and confident and quite handsome, with gently waving hair. He is emotionally repressed, his feelings showing only as a subtle flicker, and is literally and figuratively \"buttoned up\" in a frock coat which forms part of a full Victorian Muggle outfit with a shirt, waistcoat and trousers","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"Basically, in the movies he’s portrayed as this quiet yet irritable teacher who is (as the image describes) a tragic anti-hero (I refuse to use the word ‘sexy’ in conjunction to this pillock). The movies took a lot of what made Snape the person he is and left it out in order to make him look somewhat better.","date":"2021-07-25","like":0,"unlike":0,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":"images\/uploads\/60fd6732935d58.77713855.png"}],"check":true,"img":""},{"_id":{"$oid":"60fa407b095700002e0026f2"},"header":"What movie role convinced you that an actor\/actress you thought was terrible was actually very good?","id_User":{"$oid":"60fd35f768f6813ec9869f94"},"date_created":"2021-07-23","categories":"Movies","Tags":["TV-SHOWS"],"detail":"Chris Evans for Captain America. To be honest, I never thought he would pull it off. He was more like the human torch as we saw him in Fantastic Four and of course him being the casting choice would have been odd. But then he displayed his greatest acting abilities with heroism as Captain America and was so good, that I wish I could apologize to him in person lol. He nailed the character, learned combat for the role, gained 20 pounds of muscle mass, dyed his hair blonde and spoke in mannerisms that resembled Captain America and he literally embodied the character.","like":0,"unlike":0,"Answer":[],"check":true,"img":""},{"_id":{"$oid":"60fa86ca476d0000a3006fc2"},"header":"Will humans ever totally stop eating meat?","id_User":{"$oid":"60dd856d5cf2404ae46f63b4"},"date_created":"2021-07-23","categories":"Health","Tags":["EATING"],"detail":"Original question: Will humans ever totally stop eating meat?\r\n\r\nOf course not.","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"Nope. Why would we? Other then improper farming. the fact North Americans eat way too much meat. Why? It’s completely healthy when done properly, for the animal and the environment. What’s your reason? Morality? Tell that to the lion that runs down his prey.","date":"2021-07-23","like":0,"unlike":0,"Avatar":"images\/users\/user-3.jpg","Name":"Nguyễn Hà Minh Nghi","check":true,"img":""}],"check":true,"img":""},{"_id":{"$oid":"60fbe335f76d0000870034a2"},"header":"What are some really good movies\/tv shows on Netflix?","id_User":{"$oid":"60fd37cf68f6813ec9869f99"},"date_created":"2021-07-24","categories":"Movies","Tags":["NETFLIX"],"detail":"Ofcourse. I watch Netflix with my daughter every weekend. It depends on the kind of person you are, if you are a teenager and you are probably a fan of love I’ll advise you go for Movies like the perfect date, to all the boys I’ve loved before, kissing booth falling inn love etc but it depends solely on the kind of genre you are into.","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"Of course. I watch Netflix with my daughter every weekend. It depends on the kind of person you are, if you are a teenager and you are probably a fan of love I’ll advise you go for Movies like the perfect date, to all the boys I’ve loved before, kissing booth falling inn love etc but it depends solely on the kind of genre you are into.","date":"2021-07-24","like":0,"unlike":0,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":""},{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"Tramps","date":"2021-07-25","like":0,"unlike":0,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":"images\/uploads\/60fd6bca9f2d41.44964910.jpg"}],"check":true,"img":""},{"_id":{"$oid":"60fcfb0e085e00009e002162"},"header":"What fictional character did nothing wrong but got the short end of the stick anyway?","id_User":{"$oid":"60fd35f768f6813ec9869f94"},"date_created":"2021-07-25","categories":"Books","Tags":["BOOKS"],"detail":"Frodo Baggins (“The Lord of the Rings” 2001 - 2003 movie version, “The Hobbit: An Unexpected Journey” 2012 movie version).\r\n\r\nI’ll say it now that I love this version of Frodo! This character is who I grew up with and feel like I’ve known my whole life. :) So, with that said, let’s go ahead with the answer to this question. :)","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60fd35f768f6813ec9869f94"},"Answer":"There are probably many thousands of them. Most of the murder victims in fiction. But I'll list one.\r\n\r\nCedric Diggory .\r\n\r\nHe did nothing wrong. On the contrary, he was a fine young man, impressive (to me at least) for his unfailing sense of fair play.\r\n\r\nBut his fair play leads to his untimely demise. By cooperating with Harry Potter in the maze, he ends up falling with Harry into you-know-who's trap. Then he is murdered without a thought, as casually as one might discard a bit of scrap paper.","date":"2021-07-25","like":0,"unlike":0,"Name":"Nguyễn Thu Hà","Avatar":"images\/users\/user-1.jpg","check":true,"img":""},{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"Frodo honestly gets a lot of hate, especially in the movies he’s in. It almost seems like everyone’s out to get him, and I’m surprised that his fans didn’t like his movie self, which is really sad because they love him but hate a persona of himself because he’s weaker in the movies than he was in the books, or so they say.","date":"2021-07-25","like":0,"unlike":0,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":"images\/uploads\/60fd6652ebb7e6.59256598.png"}],"check":true,"img":""},{"_id":{"$oid":"60fd47cd085e00009e002165"},"header":"Why is a diet more important than exercise in a weight loss journey? I have seen that it has a ratio of 80:20.","id_User":{"$oid":"60dd85355cf2404ae46f63b3"},"date_created":"2021-07-25","categories":"Health","Tags":["EATING"],"detail":"Haven't you ever heard the expression ‘you can't out train a bad diet ‘, it is in essence true. What is a bad diet though, there are a few studies that have taken traditionally viewed “fast food items” like the golden arches suppliers and the twinkies too which formed the staple of an experimenter. Now granted the sample size N=1 isn't what could be viewed as a meta study but biologically we are virtually all the same. The experimenter was strict with his intake and consumed less than was required for his Basal Metabolic Intake. His health markers improved over the duration of his experiment despite eating burgers and fries and twinkies etc thereby showing that in his particular instance that it was the caloric intake or lack thereof that improved his health markers and not the macro nutrient composition and constitution.","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"i think about this pic >.<","date":"2021-07-25","like":0,"unlike":0,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":"images\/uploads\/60fd58963c2756.98405513.jpg"}],"check":true,"img":""},{"_id":{"$oid":"60fd5c96085e00009e002166"},"header":"Should I learn PHP in 2019? Is it still worth it?","id_User":{"$oid":"60dd85355cf2404ae46f63b3"},"date_created":"2021-07-25","categories":null,"Tags":[null],"detail":"I have been using PHP since more than 6 years now. What I feel funny is how some people make fun of it. I'd rather begin with what people say are the bad parts (going by the popular opinion) and then tell how PHP is going to outgrow them (if it has not already done that)\r\n\r\nPHP is slow: Well, are we going to write scientific algorithms? If yes, PHP is not good. But we use PHP to present web pages. Given that use, PHP does a really great job at being very maintainable and given you have the understanding of how the web works and what software patterns are - PHP will serve you well for a long long time. By the way, Facebook takes up huge amount of load and it was written using PHP. Right now, they run it on HHVM which is fast and 'open source'. So in case you feel PHP is slow, you can just start using HHVM which runs the PHP code much faster. By the way, right now, PHP7 is the fastest scripting language available in many benchmarks you can find on the web.","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"PHP has bad frameworks: Name 10 web frameworks written in node, Ruby, Python etc. and there would be at least 20 to counter them in PHP. Trust us when we say - there is no shortage of good code in PHP. Ever for Wordpress, Joomla and Drupal (CMS frameworks) or Symfony, Yii, QCubed (development frameworks).","date":"2021-07-25","like":0,"unlike":0,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":"images\/uploads\/60fd5ce18b7dd4.73280120.png"}],"check":true,"img":"images\/uploads\/60fd5c96614c44.86288841.png"},{"_id":{"$oid":"60fe2f0e7f330000f60077e2"},"header":"What has shocked you the most about the TV show Friends reunion?","id_User":{"$oid":"60dd85355cf2404ae46f63b3"},"date_created":"2021-07-26","categories":"Movies","Tags":["TV-SHOWS"],"detail":"This question came to my feed at the right time!\r\n\r\nI just finished watching the reunion. I loved LOVED this experience.\r\n\r\nAnd to answer to your question:\r\n\r\nWhat has shocked you the most about the TV show Friends reunion?\r\n\r\nMatthew Perry, Chandler, as been a personal favorite of mine. And I loved (I mean LOVED) watching the reunion! I cried a million times and laughed a million more…. but (this pains me to say) Matthew Perry looks and sounds like he has indeed gone trough hell with his addictions. He looked fragile and also a bit bitter apart the normal sarcasm that its normal to him. That made me cry even more. Love him anyway and I do home the worse part is behind him.","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"That it happened at all. Diety, who's bright idea was that?","date":"2021-07-26","like":0,"unlike":0,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":"images\/uploads\/60fe2f527b9208.59061242.jpg"},{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"Alo","date":"2021-07-30","like":0,"unlike":0,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":""}],"check":true,"img":"images\/uploads\/60fe2f0dd5fc43.28126105.png"},{"_id":{"$oid":"60fe90657f330000f60077e3"},"header":"Is it a coincidence that words for “small” in Spanish (“pequeño”), Portuguese (“pequeno”), Italian (“piccolo”) and French (“petit”) all start with “p” or are they etymologically related?","id_User":{"$oid":"60fd37cf68f6813ec9869f99"},"date_created":"2021-07-26","categories":"Language","Tags":["SPANISH"],"detail":"All of these languages are Romance languages, so it would make sense that there are similar words. Another example of this includes:\r\n\r\n”man” [french - homme] [spanish - hombre] [portuguese - homem] [italian - uomo] while the Italian word doesn’t start with “h”, the pronunciation is similar to the rest.\r\n\r\nBecause these languages all share a common “ancestral” language, you see a lot of similarities between words, syntax, and sentence structures. It is actually said that native Spanish speakers can pretty much get the gist of what an Italian is saying almost all the time. French natives can learn Portuguese rather quickly because of their similarities.\r\n\r\nThese languages are all pretty much linked by that connection. Hope this helps!","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60fd35f768f6813ec9869f94"},"Answer":"There are other similar words in the Romance Languages that you didn’t mention. Yes, it would seem that there should be a common ancestor. There isn’t. And there really is no agreement on where they all came from.","date":"2021-07-26","like":0,"unlike":0,"Name":"Nguyễn Thu Hà","Avatar":"images\/users\/user-1.jpg","check":true,"img":"images\/uploads\/60fe90d5230220.97846043.jpg"}],"check":true,"img":"images\/uploads\/60fe9064c41750.00246820.png"},{"_id":{"$oid":"60fe91d07f330000f60077e4"},"header":"What are some screenshots that deserve 59,721k views?\r\n","id_User":{"$oid":"60fd35f768f6813ec9869f94"},"date_created":"2021-07-26","categories":"Movies","Tags":["NETFLIX"],"detail":"me First !!!!!!!!!!!!!!!!!!!!!","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"In my opinion, this pic deserve this.","date":"2021-07-26","like":0,"unlike":0,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":"images\/uploads\/60fe96a2a013b9.25130657.png"},{"IDUser":{"$oid":"60dd856d5cf2404ae46f63b4"},"Answer":"And this. ","date":"2021-07-26","like":0,"unlike":0,"Name":"Nguyễn Hà Minh Nghi","Avatar":"images\/users\/user-3.jpg","check":true,"img":"images\/uploads\/60fe96e0e28865.02422356.png"}],"check":true,"img":"images\/uploads\/60fe91d015d296.21703956.png"},{"_id":{"$oid":"6101277e0d50000067000852"},"header":"You've been assigned to create a living creature that looks like a dodo by any possible means (selective breeding, gene editing, etc), how will you do it?","id_User":{"$oid":"60fd37cf68f6813ec9869f99"},"date_created":"2021-07-28","categories":"Science","Tags":["BIOLOGY"],"detail":"I’m not a gene engineer, so my first step is to hire people who are. Selective breeding would take way too long.\r\n\r\nNow, the assignment is to make a bird that LOOKS like a dodo. Not an animal that is like a dodo. So it doesn’t have to behave like a dodo, or be biologically similar to a dodo, it just has to look like one.","like":0,"unlike":0,"Answer":[{"IDUser":{"$oid":"60dd85355cf2404ae46f63b3"},"Answer":"I’d take a cassowary and send them to the pet barber to trim & color feathers.\r\nIn the meanwhile, I’d have someone build a custom prosthetic mask that looks like a Dodo and fits comfortably into the cassowary’s head.\r\nProblem solved; we now have a living creature that *looks* like a Dodo.\r\nPerfection:","date":"2021-07-28","like":0,"unlike":0,"Name":"Nguyễn Hà Minh","Avatar":"images\/users\/user-2.jpg","check":true,"img":"images\/uploads\/610127f5d6b884.38238156.png"},{"IDUser":{"$oid":"60fd37cf68f6813ec9869f99"},"Answer":"hey i think that good","date":"2021-07-30","like":0,"unlike":0,"Name":"Trần Tiến Minh","Avatar":"images\/users\/user-7.jpg","check":true,"img":""}],"check":true,"img":"images\/uploads\/6101277ccea5a5.32428584.png"}]